//•	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
//•	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
//•	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
//•	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка

//Джеси решава, че иска да се занимава с баскетбол, 
//но за да тренира е нужна екипировка. Напишете програма, //
//която изчислява какви разходи ще има Джеси, ако започне да тренира, 
//като знаете колко е таксата за тренировки по баскетбол за период от 1 година. Нужна екипировка: 

function basketBall(input){
    let yearlyPrice = Number(input[0]);
    let shoes = 0.6 * yearlyPrice;
    let clothes = shoes - (0.2 * shoes);
    let ball = 0.25 * clothes;
    let accessories = 0.2 * ball;
    let tax = yearlyPrice + shoes + clothes + ball + accessories;
    console.log(tax);


}
basketBall(["365"]);


