//Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и котки.  
//Храната се пазарува от зоомагазин, като една опаковка храна за кучета е на цена 2.50 лв, 
//а опаковка храна за котки струва 4 лв.

//1.	Броят на опаковките храна за кучета * 2.5
//2.	Броят на опаковките храна за котки * 4

function zoo(input){
    let dog = Number(input[0]);
    let cat = Number(input[1]);
    let totalPrice = (dog * 2.5) + (cat * 4);
    console.log(totalPrice + " lv.");
}
zoo(["5", "4"]);
